README.org
* Configuration of this file                                       :noexport:

#+COMMENT: This header is generated from yasnippet (main-header)
#+COMMENT: version: 0.1.1

#+TODO: TODO(t) NEXT(x) WIP(i) WAIT(w@/!) BACK-LATER(b@/!) | DONE(d!) CANCELED(c@)

#+TITLE:     MPOSL Emacs ORG Tutorial
#+AUTHOR:    Marcin Praczko
#+EMAIL:     marcin.praczko@gmail.com
#+DATE:      2024-03-27

#+COLUMNS: %PRIORITY(PR) %40ITEM(Task) %TAGS %TODO %CLOCKSUM %CLICKUP

#+DESCRIPTION: Tutorial for Emacs ORG
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

* Table of content                                                 :noexport:

* Welcome

Welcome to =MPOSL= personal Emacs Org tutorial!

In this tutorial, we'll explore the fundamentals of Emacs Org mode, a powerful tool for organizing your life and work.
Let's dive in and discover how Org mode can streamline your workflow and boost your productivity!

* General details

This tutorial is designed to allow you to do simple steps on daily basics to improve your knowledge and experience in =Emacs-ORG=.

** Details about files and directories

- Files:
  - =README.org= - this document - exported to =README.txt=
  - =emacs-tutorial.org= - Main tutorial
  - =.emacs-mposl-tutorial.el= - Custom emacs configuration - designed to allow work with this tutorial

- Folders:
  - =practice= - This folder is having files designed to allow you practice context from tutorial

* Generating README.txt

=README.txt= is generated from =README.org= with following commands in emacs:

- =C-c C-e= - then =t a= (Export to simple text file)
