README.txt
                       __________________________

                        MPOSL EMACS ORG TUTORIAL

                             Marcin Praczko
                       __________________________


                               2024-03-27


Table of Contents
_________________

1. Welcome
2. General details
.. 1. Details about files and directories
3. Generating README.txt


1 Welcome
=========

  Welcome to `MPOSL' personal Emacs Org tutorial!

  In this tutorial, we'll explore the fundamentals of Emacs Org mode, a
  powerful tool for organizing your life and work.  Let's dive in and
  discover how Org mode can streamline your workflow and boost your
  productivity!


2 General details
=================

  This tutorial is designed to allow you to do simple steps on daily
  basics to improve your knowledge and experience in `Emacs-ORG'.


2.1 Details about files and directories
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  - Files:
    - `README.org' - this document - exported to `README.txt'
    - `emacs-tutorial.org' - Main tutorial
    - `.emacs-mposl-tutorial.el' - Custom emacs configuration - designed
      to allow work with this tutorial

  - Folders:
    - `practice' - This folder is having files designed to allow you
      practice context from tutorial


3 Generating README.txt
=======================

  `README.txt' is generated from `README.org' with following commands in
  emacs:

  - `C-c C-e' - then `t a' (Export to simple text file)
